# Подвиг 7. Продолжите программу, в которой уже объявлена функция f и формируется кортеж t:
# def f(x):
#     return abs(x) ** 0.5 + 3.2 + x
# t = tuple(map(float, input().split()))  # кортеж t в программе не менять
# Необходимо продолжить эту программу и с помощью генератора списка сформировать двумерный (вложенный)
# список lst на основе кортежа t, состоящий из следующих значений:
# https://stepik.org/lesson/1764713/step/9?unit=1790001
# При описании генератора воспользуйтесь моржовой операцией для однократного вызова функции f(x)
# для каждого значения кортежа t. То есть, при формировании каждого вложенного списка:
# функция должна вызываться однократно (один раз).
# P.S. На экран ничего выводить не нужно.

def f(x):
    return abs(x) ** 0.5 + 3.2 + x


t = tuple(map(float, input().split()))  # кортеж t в программе не менять

lst = [[(y := f(x)), y**2, y**3] for x in t]
