# Подвиг 5*. На плоскости размером rect_width x rect_height (ширина x высота) размещены непересекающиеся
# прямоугольники одинаковых размеров w x h, следующих друг за другом, как показано на рисунке ниже:

# Величины rect_width, rect_height, w, h читаются из входного потока следующим образом:

# rect_width, rect_height, w, h = map(int, input().split())
        
# Необходимо вычислить общее число прямоугольников не умещающихся целиком на плоскости. Результат 
# (количество не умещающихся прямоугольников) сохранить в переменной total.

# Программу реализовать без применения условных операторов, только используя изученный материал.

# P.S. На экран ничего выводить не нужно.