# Подвиг 6. На вход программе подается натуральное число n (то есть, целое положительное). 
# Прочитайте это число. В цикле переберите все целые числа в интервале [1; n] (включая границы) и 
# сформируйте список из чисел, кратных 3 и 5 одновременно.
# Выведите на экран полученный список чисел в одну строчку через пробел, если значение n меньше 100. 
# Иначе выведите на экран сообщение (без кавычек):
# "слишком большое значение n"
# Продумать логику работы программы так, чтобы после цикла while шел блок else.

n =int(input())
lst = []
i = 1
while i <= n:
    if i % 3 == 0 and i % 5 == 0:
        lst.append(i)
    i += 1
else:
    if n < 100:
        print(*lst)
    else:
        print("слишком большое значение n")
