# Большой подвиг 5. (Для закрепления предыдущего материала). 
# На вход программе подается таблица целых чисел (см. пример ниже) 
# размером N x N элементов (N определяется по входным данным). 
# Эти числа сохранены в виде двумерного (вложенного) списка lst2D размером N x N элементов. 
# Полученная таблица содержит нули и кое-где единицы. С помощью функции с именем verify, 
# на вход которой подается двумерный список чисел lst2D (первый параметр), 
# необходимо проверить, являются ли единицы изолированными друг от друга, то есть, 
# вокруг каждой единицы должны быть нули.
# Рекомендуется следующий алгоритм. В функции verify производить перебор двумерного списка. 
# Для каждого элемента (списка) со значением 1 вызывать еще одну вспомогательную функцию is_isolate 
# для проверки изолированности единицы. То есть, функция is_isolate должна возвращать True, 
# если единица изолирована и False в противном случае.
# Как только встречается не изолированная единица, функция verify должна возвращать False. 
# Если успешно доходим (по элементам списка) до конца, то возвращается значение True.
# Функцию verify выполнять не нужно, только объявить.
# P. S. При реализации функции is_isolate не следует прописывать восемь операторов if. 
# Подумайте, как это можно сделать красивее (с точки зрения реализации алгоритма). 

import sys

def is_isolate(lst):
    return sum(lst) < 2


def verify(lst):
    size = len(lst)
    return False not in [is_isolate(lst[i][j:j+2] + lst[i+1][j:j+2])
                         for i in range(size - 1)      # внешний — строки
                        for j in range(size - 1)]     # внутренний — столбцы

lines = sys.stdin.readlines() # чтение строк из входного потока (переменную lines не менять)
lst2D = [list(map(int, x.strip().split())) for x in lines] # формирование матрицы чисел
