# Подвиг 7. Объявите в программе функцию с двумя параметрами width и height (ширина и высота прямоугольника), 
# которая выводит сообщение (без кавычек):
# "Периметр прямоугольника, равен x"                 
# где x - вычисленный периметр прямоугольника. 
# После объявления функции прочитайте (с помощью функции input) два целых числа, 
# записанных в одну строку через пробел, и вызовите функцию с этими числовыми значениями.

def print_perimetr(width, heigth):
    perimetr = (width + heigth) * 2
    print(f'Периметр прямоугольника, равен {perimetr}')


print_perimetr(*map(int, input().split()))
