# Подвиг 8. Объявите в программе функцию с одним параметром,
# которая проверяет корректность переданного ей email-адреса в виде строки.
# Полагается, что адрес верен, если он обязательно содержит символы '@' и '.',
# а все остальные символы могут принимать значения: 'a-z', 'A-Z', '0-9' и '_'.
# Если email верен, то функция выводит "ДА", иначе "НЕТ".
# После объявления функции прочитайте (с помощью функции input) строку
# с email-адресом и вызовите функцию с этим аргументом.

def is_valid_email(email):
    is_valid = 'ДА'
    if '@' in email and '.' in email:
        for symbol in email:
            if not ('a' <= symbol <= 'z' or
                    'A' <= symbol <= 'Z' or
                    '0' <= symbol <= '9' or
                    symbol in '_.@'):
                is_valid = 'НЕТ'
                break
    else:
        is_valid = 'НЕТ'
    print(is_valid)


is_valid_email(input())
