# Подвиг 8. На вход программе подаются два целых числа, которые следует прочитать следующими командами:

# a = int(input())
# b = int(input())
            
# Затем, используя оператор конкатенации (соединения) строк, сформировать строку вида (без кавычек):
# "Переменная a = <значение>, переменная b = <значение>"        
# Результат (строку) выведите на экран.
# P. S. F-строки в программе не применять.

a = int(input())
b = int(input())
print('Переменная a = ' + str(a) + ', переменная b = ' + str(b))
