# Подвиг 4. В ночном клубе фиксируется список гостей. 
# Причем гости могут выходить из помещения, а затем, снова заходить. 
# Тогда их имена фиксируются повторно. 
# На вход программы поступает такой список (каждое имя записано с новой строки). 
# В программе уже реализовано считывание этих строк и сохранение в списке:
# lst_in = list(map(str.strip, sys.stdin.readlines()))                
# Требуется подсчитать по списку lst_in общее число гостей, которые посетили ночной клуб. 
# Полагается, что гости имеют уникальные имена. На экран вывести общее число гостей клуба.

import sys

lst_in = list(map(str.strip, sys.stdin.readlines()))

guests = len(set(lst_in))

print(guests)
