# Подвиг 3. На вход программе подаются целые числа, записанные через пробел. 
# Необходимо их прочитать и с помощью list comprehension сформировать двумерный список lst размером N x N 
# (квадратную таблицу чисел). Гарантируется, что из набора введенных чисел можно сформировать 
# квадратную матрицу (таблицу). Полученный двумерный список отобразить командой:



lst = list(map(int, input().split()))

length = int(len(lst) ** 0.5)

result = [[lst[length * i + j]
           for j in range(length)]
           for i in range(length)]

print(result)
