# Подвиг 5. На вход программе подается строка со словами, записанными через пробел. 
# Необходимо прочитать эту строку и с помощью генераторов множеств и словарей сформировать словарь в формате:
# {слово_1: количество_1, слово_2: количество_2, ..., слово_N: количество_N}
# То есть, ключами выступают уникальные слова (без учета регистра), 
# а значениями - число их встречаемости в тексте. 
# На экран вывести значение словаря для слова (союза) 'и'. Если такого ключа нет, то вывести 0.

s = input().lower().split()

words = {word: s.count(word) for word in s }

print(words.get('и', 0))
