# Подвиг 1. На вход программе подаются два списка целых чисел, каждый с новой строки 
# (в строке наборы чисел следующих через пробел). 
# Необходимо прочитать эти наборы чисел и сохранить их в отдельных списках (или кортежах) как целые числа. 
# Затем, с помощью множеств(а) выбрать только уникальные числа, присутствующие и в 
# первом и во втором списках одновременно. Результат выведите на экран в виде строки чисел, 
# записанных по возрастанию через пробел, используя команду (здесь s - это множество, содержащее уникальные числа):

lst_1 = list(map(int, input().split()))
lst_2 = list(map(int, input().split()))

# unique = set(lst_1) & set(lst_2)
unique = set(lst_1).intersection(set(lst_2))


print(*sorted(unique))
