# Подвиг 5. На вход программе подается закодированная строка с помощью азбуки Морзе. 
# Коды разделены между собой пробелом. Необходимо ее раскодировать, используя азбуку Морзе из предыдущего занятия. 
# Все буквы в строке должны быть малыми (нижний регистр). Полученное сообщение (строку) вывести на экран.

# P.S. Буквам е(ё) соответствует один и тот же код Морзе, поэтому всюду подставляется буква 'е'.

d = {'а': '.-', 'б': '-...', 'в': '.--', 'г': '--.', 'д': '-..', 'е': '.',
      'ж': '...-', 'з': '--..', 'и': '..', 'й': '.---', 'к': '-.-',
       'л': '.-..', 'м': '--', 'н': '-.', 'о': '---', 'п': '.--.', 'р': '.-.',
       'с': '...', 'т': '-', 'у': '..-', 'ф': '..-.', 'х': '....', 'ц': '-.-.',
       'ч': '---.', 'ш': '----', 'щ': '--.-', 'ъ': '--.--', 'ы': '-.--',
       'ь': '-..-', 'э': '..-..', 'ю': '..--', 'я': '.-.-', ' ': '-...-'}

morze = input().split()

decod = ''

for s in morze:
    for k, v in d.items():
        if s == v:
            decod += k

print(decod)
