# Подвиг 4. На вход программе подается строка из русских букв и символов пробела. 
# Необходимо ее прочитать и закодировать азбукой Морзе, 
# где каждой букве ставится в соответствие код из точки и тире. 
# После каждой закодированной буквы должен стоять пробел (символ окончания кода буквы). 
# После последнего кода пробела быть не должно (в конце строки). 
# Коды азбуки Морзе приведены ниже для русского алфавита и символа пробела:
# https://stepik.org/lesson/567047/step/6?unit=561321
# Результат кодирования вывести в виде строки.
# P. S. Для очень ленивых готовый словарь азбуки Морзе можно скачать по адресу: 
# https://github.com/selfedu-rus/others (файл morze-dict.py). 
# Для практики лучше его составить самостоятельно. Да, работа программиста зачастую связана и с такой рутиной.


d = {'а': '.-', 'б': '-...', 'в': '.--', 'г': '--.', 'д': '-..', 'е': '.',
       'ё': '.', 'ж': '...-', 'з': '--..', 'и': '..', 'й': '.---', 'к': '-.-',
       'л': '.-..', 'м': '--', 'н': '-.', 'о': '---', 'п': '.--.', 'р': '.-.',
       'с': '...', 'т': '-', 'у': '..-', 'ф': '..-.', 'х': '....', 'ц': '-.-.',
       'ч': '---.', 'ш': '----', 'щ': '--.-', 'ъ': '--.--', 'ы': '-.--',
       'ь': '-..-', 'э': '..-..', 'ю': '..--', 'я': '.-.-', ' ': '-...-'}

print(*[d[c] for c in input().lower()])
