# Подвиг 4. Объявите в программе функцию, которая первым параметром принимает строку 
# (с кириллицей и латиницей) и преобразовывает в ней кириллические символы в латиницу, 
# используя следующий словарь для замены русских букв на соответствующее латинское написание:
# t = {'ё': 'yo', 'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd', 'е': 'e', 'ж': 'zh',
#      'з': 'z', 'и': 'i', 'й': 'y', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n', 'о': 'o', 'п': 'p',
#      'р': 'r', 'с': 's', 'т': 't', 'у': 'u', 'ф': 'f', 'х': 'h', 'ц': 'c', 'ч': 'ch', 'ш': 'sh',
#      'щ': 'shch', 'ъ': '', 'ы': 'y', 'ь': '', 'э': 'e', 'ю': 'yu', 'я': 'ya'}                 
# Функция должна возвращать результат преобразования переданной строки в латиницу. 
# Замены делать без учета регистра (исходную строку вначале следует перевести в нижний регистр - малые буквы).
# Второй параметр функции с именем sep и начальным значением в виде строки "-" 
# определяет символ для замены пробелов в строке.
# На вход программе подается строка, которую необходимо прочитать (после объявления функции). 
# Затем, дважды вызовите функцию (с выводом результата ее работы на экран):
# первый раз только с прочитанной строкой;
# второй раз с прочитанной строкой и именованным аргументом sep со значением '+'.

def to_latin(text, sep='-'):
    t = {'ё': 'yo', 'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd', 'е': 'e', 'ж': 'zh',
    'з': 'z', 'и': 'i', 'й': 'y', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n', 'о': 'o', 'п': 'p',
    'р': 'r', 'с': 's', 'т': 't', 'у': 'u', 'ф': 'f', 'х': 'h', 'ц': 'c', 'ч': 'ch', 'ш': 'sh',
    'щ': 'shch', 'ъ': '', 'ы': 'y', 'ь': '', 'э': 'e', 'ю': 'yu', 'я': 'ya', '!': "!"}
    text_latin = ''
    for c in text:
        if c == ' ':
            text_latin += sep
        elif 'a' <= c <= 'z':
             text_latin += c
        else:
            text_latin += t[c]

    return text_latin

s = input().lower()

print(to_latin(s))
print(to_latin(s, sep='+'))
