# Подвиг 6. В функцию из предыдущего подвига 5 добавьте в конец еще один третий параметр up 
# с начальным булевым значением True. Если параметр up равен True, то тег, указанный 
# в параметре tag, следует записывать заглавными буквами, а иначе малыми.
# После объявления функции далее в программе прочитайте из входного потока строку и 
# дважды вызовите функцию (с выводом результата ее работы на экран):
# первый раз со строкой и именованным аргументом tag со значением 'div';
# второй раз со строкой, именованным аргументом tag со значением 'div' и именованным аргументом up со значением False.

def get_tag(text, tag='h1', up=True):
    tag = tag.upper() if up else tag.lower()
    new_s = f'<{tag}>{text}</{tag}>'
    return new_s


s = input()

print(get_tag(s, tag='div'))
print(get_tag(s, tag='div', up=False))
