# Подвиг 6. На вход программе подаются данные в формате ключ=значение, записанные через пробел.
# Необходимо прочитать строку с этими данными и на их основе сформировать словарь d.
# Затем удалить из этого словаря ключи 'False' и '3', если они существуют.
# Ключами и значениями словаря являются строки. Вывести полученный словарь на экран командой:
# print(*sorted(d.items()))


d = dict([text.split('=') for text in input().split()])

if 'False' in d:
    del d['False']

if '3' in d:
    del d['3']

print(*sorted(d.items()))
