# Подвиг 9. На вход программе поступают целые положительные числа.
# Необходимо с помощью цикла реализовать их считывание, пока не встретится число 0.
# В теле цикла для каждого прочитанного числа вычисляется квадратный корень (с точностью до сотых)
# и значение выводится на экран (в столбик). С помощью словаря выполните кэширование данных так,
# чтобы при повторном вводе того же самого числа результат не вычислялся,
# а бралось ранее вычисленное значение (из словаря). При этом на экране должно выводиться:
# значение из кэша: <число>
# Округление следует выполнять с помощью функции round()

d = {}

while True:
    x = int(input())
    if x != 0:
        if x not in d:
            d[x] = round(x ** 0.5, 2)
            print(d[x])
        else:
            print(f'значение из кэша: {d[x]}')
    else:
        break
