# Подвиг 7. На вход программе подаются номера телефонов, записанные в одну строчку через пробел,
# с разными кодами стран: +7, +6, +2, +4 и т.д. Необходимо прочитать строку и на ее основе сформировать словарь d.
# Ключами словаря должны быть коды (строки: +7, +6, +2 и т. п.), а значениями список номеров в виде строк 
# (следующих в том же порядке, что и в исходной строке) с соответствующими кодами. 
# Полученный словарь вывести командой:
# print(*sorted(d.items()))

lst = input().split()

d = {}

for elem in lst:
    if elem[:2] not in d:
        d[elem[:2]] = [elem]
    else:
        d[elem[:2]].append(elem)

print(*sorted(d.items()))
