# Подвиг 8. На вход программе поступают номера телефонов с привязкой к именам в виде строк следующего формата:
# номер_1 имя_1
# номер_2 имя_2
# ...
# номер_N имя_N
# В программе уже реализовано считывание всех строк и сохранение их в виде списка:
# lst_in = list(map(str.strip, sys.stdin.readlines()))            
# Формат списка следующий:
# lst_in = ['номер_1 имя_1', 'номер_2 имя_2', ...]            
# На основе списка lst_in необходимо создать словарь d, где ключами будут имена, а значениями - 
# список номеров телефонов для этого имени (ключа). Обратите внимание, что одному имени может 
# принадлежать несколько разных номеров. Полученный словарь вывести командой:
# print(*sorted(d.items()))

import sys

# считывание списка из входного потока
lst_in = list(map(str.strip, sys.stdin.readlines()))

# здесь продолжайте программу (используйте список lst_in)

d = {}

for s in lst_in:
    v, k = s.split()
    if k not in d:
        d[k] = [v]
    else:
        d[k].append(v)

print(*sorted(d.items()))
